## 🧾 Terraform Plan for `gov_org`

> ⚠️ Review this carefully before applying changes

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.gov_org_advanced.aws_organizations_account.account["bill"] will be created
  + resource "aws_organizations_account" "account" {
      + arn                        = (known after apply)
      + close_on_deletion          = false
      + create_govcloud            = false
      + email                      = "billing@example.com"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "Billing Account"
      + parent_id                  = (known after apply)
      + role_name                  = "OrganizationAccountAccessRole"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # module.gov_org_advanced.aws_organizations_account.account["sec"] will be created
  + resource "aws_organizations_account" "account" {
      + arn                        = (known after apply)
      + close_on_deletion          = false
      + create_govcloud            = false
      + email                      = "security@example.com"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "Security Account"
      + parent_id                  = (known after apply)
      + role_name                  = "OrganizationAccountAccessRole"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # module.gov_org_advanced.aws_organizations_delegated_administrator.delegated_admins["billing"] will be created
  + resource "aws_organizations_delegated_administrator" "delegated_admins" {
      + account_id              = (known after apply)
      + arn                     = (known after apply)
      + delegation_enabled_date = (known after apply)
      + email                   = (known after apply)
      + id                      = (known after apply)
      + joined_method           = (known after apply)
      + joined_timestamp        = (known after apply)
      + name                    = (known after apply)
      + service_principal       = "billing.amazonaws.com"
      + status                  = (known after apply)
    }

  # module.gov_org_advanced.aws_organizations_delegated_administrator.delegated_admins["config"] will be created
  + resource "aws_organizations_delegated_administrator" "delegated_admins" {
      + account_id              = (known after apply)
      + arn                     = (known after apply)
      + delegation_enabled_date = (known after apply)
      + email                   = (known after apply)
      + id                      = (known after apply)
      + joined_method           = (known after apply)
      + joined_timestamp        = (known after apply)
      + name                    = (known after apply)
      + service_principal       = "config.amazonaws.com"
      + status                  = (known after apply)
    }

  # module.gov_org_advanced.aws_organizations_delegated_administrator.delegated_admins["guardduty"] will be created
  + resource "aws_organizations_delegated_administrator" "delegated_admins" {
      + account_id              = (known after apply)
      + arn                     = (known after apply)
      + delegation_enabled_date = (known after apply)
      + email                   = (known after apply)
      + id                      = (known after apply)
      + joined_method           = (known after apply)
      + joined_timestamp        = (known after apply)
      + name                    = (known after apply)
      + service_principal       = "guardduty.amazonaws.com"
      + status                  = (known after apply)
    }

  # module.gov_org_advanced.aws_organizations_organization.this will be created
  + resource "aws_organizations_organization" "this" {
      + accounts             = (known after apply)
      + arn                  = (known after apply)
      + feature_set          = "ALL"
      + id                   = (known after apply)
      + master_account_arn   = (known after apply)
      + master_account_email = (known after apply)
      + master_account_id    = (known after apply)
      + non_master_accounts  = (known after apply)
      + roots                = (known after apply)
    }

  # module.gov_org_advanced.aws_organizations_organizational_unit.ou["billing"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Billing"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.gov_org_advanced.aws_organizations_organizational_unit.ou["security"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Security"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.gov_org_basic.aws_organizations_organization.this will be created
  + resource "aws_organizations_organization" "this" {
      + accounts             = (known after apply)
      + arn                  = (known after apply)
      + feature_set          = "ALL"
      + id                   = (known after apply)
      + master_account_arn   = (known after apply)
      + master_account_email = (known after apply)
      + master_account_id    = (known after apply)
      + non_master_accounts  = (known after apply)
      + roots                = (known after apply)
    }

  # module.gov_org_basic.aws_organizations_organizational_unit.ou["core"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Core"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.gov_org_basic.aws_organizations_organizational_unit.ou["dev"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Development"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.gov_org_basic.aws_organizations_organizational_unit.ou["prod"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Production"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_account.account["billing_account"] will be created
  + resource "aws_organizations_account" "account" {
      + arn                        = (known after apply)
      + close_on_deletion          = false
      + create_govcloud            = false
      + email                      = "billing@myorg.com"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "Billing Account"
      + parent_id                  = (known after apply)
      + role_name                  = "OrganizationAccountAccessRole"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_account.account["dev_account"] will be created
  + resource "aws_organizations_account" "account" {
      + arn                        = (known after apply)
      + close_on_deletion          = false
      + create_govcloud            = false
      + email                      = "dev@myorg.com"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "Dev Account"
      + parent_id                  = (known after apply)
      + role_name                  = "OrganizationAccountAccessRole"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_account.account["prod_account"] will be created
  + resource "aws_organizations_account" "account" {
      + arn                        = (known after apply)
      + close_on_deletion          = false
      + create_govcloud            = false
      + email                      = "prod@myorg.com"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "Prod Account"
      + parent_id                  = (known after apply)
      + role_name                  = "OrganizationAccountAccessRole"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_account.account["security_account"] will be created
  + resource "aws_organizations_account" "account" {
      + arn                        = (known after apply)
      + close_on_deletion          = false
      + create_govcloud            = false
      + email                      = "security@myorg.com"
      + govcloud_id                = (known after apply)
      + iam_user_access_to_billing = "ALLOW"
      + id                         = (known after apply)
      + joined_method              = (known after apply)
      + joined_timestamp           = (known after apply)
      + name                       = "Security Account"
      + parent_id                  = (known after apply)
      + role_name                  = "OrganizationAccountAccessRole"
      + status                     = (known after apply)
      + tags_all                   = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_delegated_administrator.delegated_admins["billing"] will be created
  + resource "aws_organizations_delegated_administrator" "delegated_admins" {
      + account_id              = (known after apply)
      + arn                     = (known after apply)
      + delegation_enabled_date = (known after apply)
      + email                   = (known after apply)
      + id                      = (known after apply)
      + joined_method           = (known after apply)
      + joined_timestamp        = (known after apply)
      + name                    = (known after apply)
      + service_principal       = "billing.amazonaws.com"
      + status                  = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_delegated_administrator.delegated_admins["config"] will be created
  + resource "aws_organizations_delegated_administrator" "delegated_admins" {
      + account_id              = (known after apply)
      + arn                     = (known after apply)
      + delegation_enabled_date = (known after apply)
      + email                   = (known after apply)
      + id                      = (known after apply)
      + joined_method           = (known after apply)
      + joined_timestamp        = (known after apply)
      + name                    = (known after apply)
      + service_principal       = "config.amazonaws.com"
      + status                  = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_delegated_administrator.delegated_admins["guardduty"] will be created
  + resource "aws_organizations_delegated_administrator" "delegated_admins" {
      + account_id              = (known after apply)
      + arn                     = (known after apply)
      + delegation_enabled_date = (known after apply)
      + email                   = (known after apply)
      + id                      = (known after apply)
      + joined_method           = (known after apply)
      + joined_timestamp        = (known after apply)
      + name                    = (known after apply)
      + service_principal       = "guardduty.amazonaws.com"
      + status                  = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_organization.this will be created
  + resource "aws_organizations_organization" "this" {
      + accounts             = (known after apply)
      + arn                  = (known after apply)
      + feature_set          = "ALL"
      + id                   = (known after apply)
      + master_account_arn   = (known after apply)
      + master_account_email = (known after apply)
      + master_account_id    = (known after apply)
      + non_master_accounts  = (known after apply)
      + roots                = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_organizational_unit.ou["billing"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Billing"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_organizational_unit.ou["dev"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Development"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_organizational_unit.ou["prod"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Production"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.gov_org_complete.aws_organizations_organizational_unit.ou["security"] will be created
  + resource "aws_organizations_organizational_unit" "ou" {
      + accounts  = (known after apply)
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "Security"
      + parent_id = (known after apply)
      + tags_all  = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

Warning: Attribute Deprecated

  with provider["registry.terraform.io/hashicorp/aws"],
  on providers.tf line 7, in provider "aws":
   7:   s3_force_path_style         = true

Use s3_use_path_style instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

<!-- Sticky Pull Request Comment -->